tap "akeru-inc/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "minacle/chntpw"
tap "sidneys/homebrew"

# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Download with resuming and segmented downloading
brew "aria2"
# Bastard Tetris
brew "bastet"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Unit testing framework for C
brew "cmocka"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Configurable talking characters in ASCII art
brew "cowsay"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# WebDriver <-> Marionette proxy
brew "geckodriver"
# Distributed revision control system
brew "git"
# Tool Command Language
brew "tcl-tk"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Improved top (interactive process viewer)
brew "htop"
# Audio Connection Kit
brew "jack"
# Statically typed programming language for the JVM
brew "kotlin"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Cryptographic & SSL/TLS library
brew "mbedtls@2"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Fast and user friendly build system
brew "meson"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node"
# Cross-platform application and UI framework
brew "qt@5"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Generate scripting interfaces to C/C++ code
brew "swig"
# Terminal multiplexer
brew "tmux"
# Digital clock in ncurses
brew "tty-clock"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Download YouTube videos from the command-line
brew "youtube-dl"
# macOS app notarization helper
brew "akeru-inc/tap/xcnotary"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# The Offline NT Password Editor
brew "minacle/chntpw/chntpw"
# Android SDK component
cask "android-platform-tools"
cask "font-hack-nerd-font"
# Torrent streaming application
cask "webtorrent"
# Compatibility layer to run Windows applications
cask "wine-stable"
